<?php

return [
    "common" => [
        "errors" => [
            "lang" => "يرجى التحقق من جزء الرابط بعد 'api/' والتأكد من أنه يحدد واحدة من: fr أو ar أو en",
            'deactivated_account' => "تم إلغاء تنشيط حسابك. يرجى إعادة تفعيله أو الاتصال بمسؤولك",
        ]
    ],
    "responses" => [
        "maintenance" => "التطبيق قيد الصيانة حالياً. يرجى المحاولة لاحقاً.",
        "logout" => "تم تسجيل خروجك بنجاح.",
        "logout_all_devices" => "تم تسجيل خروجك بنجاح من جميع أجهزتك.",
        'account_activated' => "تم تفعيل حسابك بنجاح. مرحباً بعودتك!",
        'account_deactivated' => "تم إلغاء تفعيل حسابك بنجاح. نتطلع لعودتك قريباً.",
    ],
    "change_email" => [
        "errors" => [
            "old_email" => "البريد الإلكتروني الذي أدخلته لا يتطابق مع بريدك الإلكتروني الحالي.",
            "new_email" => "يجب أن يكون البريد الإلكتروني الجديد مختلفاً عن البريد الحالي."
        ]
    ],
    "users" => [
        "responses" => [
            "bulk_insert_success" => "تمت إضافة جميع الأشخاص بنجاح.",
            "destroy" => "تم حذف حسابك بنجاح."
        ],
        "errors" => [
            "update" => [
                "no-access" => "لا يمكنك تحديث هذا الحساب. فقط مالك الحساب يمكنه تنفيذ هذا الإجراء."
            ],
            "destroy" => [
                "no-access" => "لا يمكنك حذف هذا الحساب. فقط مالك الحساب يمكنه تنفيذ هذا الإجراء."
            ]
        ]
    ],
    "occupations" => [
        "responses" => [
            "destroy" => "تم حذف المهنة بنجاح."
        ],
        "errors" => [
            "not-belong" => "المهنة لا تنتمي إلى المستخدم المحدد."
        ]
    ],
    "banking_information" => [
        "responses" => [
            "destroy" => "تم حذف المعلومات البنكية بنجاح."
        ],
        "errors" => [
            "not-found" => "لم يتم العثور على مالك الحساب."
        ]
    ],
];
