<?php

return [

    'user' => [
        'actions' => [
            'add' => "إنشاء مستخدم",
            'update' => "تعديل المستخدم: :name",
            'manage' => [
                'roles' => 'إدارة الأدوار: :name',
            ],
        ],
    ],
    'person' => [
        'actions' => [
            'add' => "إضافة موظف",
            'update' => "تعديل الموظف: :name",
            'manage' => [
                'occupations' => 'إدارة المهن: :name',
                'banking_information' => 'إدارة المعلومات البنكية: :name',
                'account' => 'إدارة الحساب: :name',
            ],
        ],
    ],
    "banking_info" => [
        "actions" => [
            "add" => "إضافة تفاصيل بنكية",
            "update" => "تحديث المعلومات البنكية"
        ]
    ],

    'field' => [
        'actions' => [
            'add' => 'إنشاء مجال مهني جديد',
            'update' => 'تحديث المجال: :acronym',
            'manage' => [
                'grades' => 'إدارة مستويات الدرجات',
                'specialties' => 'إدارة التخصصات',
            ],
        ],
    ],
    'wilaya' => [
        'actions' => [
            'add' => 'إضافة ولاية جديدة',
            'update' => 'تحديث الولاية: :code',
            'manage' => [
                'view' => 'عرض تفاصيل الولاية',
            ],
        ],
    ],
    'daira' => [
        'actions' => [
            'add' => 'إضافة دائرة جديدة',
            'update' => 'تحديث الدائرة: :code',
        ],
    ],
    'bank' => [
        'actions' => [
            'add' => 'إضافة بنك جديد',
            'update' => 'تحديث البنك المحدد',
        ],
    ],
    'menu' => [
        'actions' => [
            'add' => 'إضافة قائمة جديدة',
            'update' => 'تحديث القائمة المحددة',
        ],
    ],
    'external_link' => [
        'actions' => [
            'add' => 'إضافة رابط خارجي جديد',
            'update' => 'تحديث الرابط الخارجي المحدد',
        ],
    ],
    "our_quality" => [
        "actions" => [
            "new" => "إضافة جودة جديدة",
            "update" => "تحديث الجودة المحددة"
        ]
    ],
    "message" => [
        "actions" => [
            "reply" => "إرسال رد"
        ]
    ],
    'slider' => [
        'actions' => [
            'add' => 'إضافة عرض تقديمي جديد لـ :name',
            'update' => 'تحديث العرض التقديمي :name',
        ],
    ],
    'slide' => [
        'actions' => [
            'add' => 'إضافة شريحة جديدة',
            'update' => 'تحديث الشريحة المحددة',
        ],
    ],
    'article' => [
        'actions' => [
            'add' => 'إضافة مقال جديد',
            'update' => 'تحديث المقال المحدد',
        ],
    ],
    'trend' => [
        'actions' => [
            'add' => 'إضافة اتجاه جديد',
            'update' => 'تحديث الاتجاه المحدد',
        ],
    ],
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////           App

    'service' => [
        'actions' => [
            'add' => 'إضافة قسم جديد',
            'update' => 'تحديث القسم :name',
            "manage_coordinators" => "إدارة منسقي :name",
        ],
    ],
];
