<?php

return [

    'general' => [
        'system_update' => 'تم تحديث النظام',
        'maintenance' => 'النظام تحت الصيانة',
        'notification' => 'لديك إشعار جديد',
    ],

    'message' => [
        'new' => 'لقد تلقيت رسالة جديدة',
        'reply' => 'قام شخص بالرد على رسالتك',
        'deleted' => 'تم حذف رسالة',
    ],

    'user' => [
        'welcome' => 'مرحبًا بك في منصتنا!',
        'profile_updated' => 'تم تحديث ملفك الشخصي بنجاح',
        'password_changed' => 'تم تغيير كلمة المرور الخاصة بك بنجاح',
        'new_follower' => 'لديك متابع جديد',
    ],

    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////           App

];
