<?php

return [
    'site_parameters' => [
        'name' => 'إعدادات الموقع',
        'titles' => [
            'main' => 'إعدادات الموقع',
        ],
    ],

    "login" => [
        "name" => "تسجيل الدخول",
        'links' => [
            'register' => 'جديد في ' . config('app.name') . ' ؟ أنشئ حساباً الآن',
            'forgot_password' => 'هل نسيت كلمة المرور؟',
        ],
        "titles" => [
            'main' => 'تسجيل الدخول',
        ]
    ],

    'register' => [
        'name' => 'إنشاء حساب',
        'links' => [
            'login' => 'لديك حساب بالفعل؟',
        ],
        'titles' => [
            'main' => 'إنشاء حساب',
        ]
    ],

    "logout" => "تسجيل الخروج",

    'forgot_password' => [
        'name' => 'نسيت كلمة المرور',
        'titles' => [
            "main" => 'استعادة حسابك',
        ]
    ],

    "profile" => [
        'name' => "الملف الشخصي",
        "titles" => [
            "main" => "مرحباً بك في ملفك الشخصي"
        ]
    ],

    "change_password" => [
        'name' => "تغيير كلمة المرور",
        "titles" => [
            "main" => "تغيير كلمة المرور"
        ]
    ],

    "change_email" => [
        "name" => "تغيير البريد الإلكتروني",
        "titles" => [
            "main" => "تغيير البريد الإلكتروني"
        ]
    ],

    "dashboard" => [
        'name' => "لوحة التحكم",
        "titles" => [
            "main" => "مرحبًا بك في لوحة التحكم :name"
        ]
    ],

    "super_admin_space" => [
        'name' => "لوحة تحكم المدير العام",
        "titles" => [
            "main" => "مرحباً بك في لوحة تحكم المدير العام"
        ]
    ],


    "manage_users" => [
        'name' => "إدارة المستخدمين",
        "titles" => [
            "main" => "إدارة المستخدمين"
        ]
    ],
    "manage_persons" => [
        'name' => "إدارة الموظفين",
        "titles" => [
            "main" => "إدارة الموظفين"
        ]
    ],
    "manage_social_works" => [
        'name' => "الأعمال الاجتماعية",
        "titles" => [
            "main" => "إدارة الأعمال الاجتماعية"
        ]
    ],

    "wilaya" => [
        'name' => "الولايات",
        "titles" => [
            "main" => "إدارة الولايات"
        ]
    ],

    "dairates" => [
        'name' => "الدوائر",
        "titles" => [
            "main" => "إدارة الدوائر (رمز الولاية: :code)"
        ]
    ],

    "occupation_fields" => [
        'name' => "المجالات المهنية",
        "titles" => [
            "main" => "إدارة المجالات المهنية"
        ]
    ],



    "general_infos" => [
        "name" => "إدارة المعلومات العامة",
        "titles" => [
            "main" => "إدارة المعلومات العامة للتطبيق"
        ],
    ],

    "manage_hero" => [
        "name" => "إدارة قسم الواجهة",
        "titles" => [
            "main" => "إدارة قسم الواجهة"
        ],
    ],

    "manage_about_us" => [
        "name" => "إدارة قسم من نحن",
        "titles" => [
            "main" => "إدارة قسم من نحن"
        ],
    ],

    "manage_our_qualities" => [
        "name" => "إدارة قسم مميزاتنا",
        "titles" => [
            "main" => "إدارة قسم مميزاتنا"
        ],
    ],

    'messages' => [
        'name' => "رسائل الزوار",
        'titles' => [
            'main' => "صندوق رسائل الزوار",
        ],
    ],

    'banks' => [
        'name' => 'إدارة البنوك',
        'titles' => [
            'main' => 'إدارة البنوك',
        ],
    ],

    'articles' => [
        'name' => 'إدارة المقالات',
        'titles' => [
            'main' => 'إدارة المقالات',
        ],
    ],

    'menus' => [
        'name' => 'إدارة القوائم',
        'titles' => [
            'main' => 'إدارة القوائم',
        ],
    ],

    'menu' => [
        'name' => 'إدارة القائمة',
        'titles' => [
            'main' => 'إدارة الروابط الخارجية للقائمة :title',
        ],
    ],

    'sliders' => [
        'name' => 'إدارة العارضات',
        'titles' => [
            'main' => 'إدارة العارضات',
        ],
    ],

    'slider' => [
        'name' => 'إدارة الشرائح',
        'titles' => [
            'main' => 'إدارة شرائح :name',
        ],
    ],

    'trends' => [
        'name' => 'إدارة الاتجاهات',
        'titles' => [
            'main' => 'إدارة الاتجاهات',
        ],
    ],

    ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////       App
    //////////////////////////////////////////////////////////////////////////////////////
    "landing_page" => [
        "name" => "الصفحة الرئيسية",
        "links" => [
            'hero' => "الصفحة الرئيسية",
            'about_us' => "من نحن",
            "services" => "أقسامنا",
            'contact_us' => "اتصل بنا"
        ],
        "sections" => [
            "hero" => [
                "call_to_actions" => [
                    'contact_us' => "اتصل بنا",
                    'get_started' => "ابدأ الرحلة"
                ]
            ],
            "about_us" => [
                "title" => "من نحن",
                "beds" => "أسرة",
                "services" => "أقسام",
                "years" => "سنوات"
            ],
            "services" => [
                'title' => "أقسامنا",
                'sub_title' => "ملتزمون بالجودة والرعاية والموثوقية"
            ],
            'contact_us' => [
                'title' => "تواصل معنا",
                'sub_title' => "يرجى تقديم عنوان بريد إلكتروني صالح حتى نتمكن من الرد على استفسارك.",
                'coordinates' => "معلومات التواصل",
                'location' => "العنوان",
                'email' => "البريد الإلكتروني",
                'phone' => "الهاتف",
                'fax' => "الفاكس",
            ],
            "footer" => [
                'copyright' => "حقوق النشر",
                "agency" => ":name",
                "reservation" => "جميع الحقوق محفوظة",
                'designed_by' => "صمم بواسطة",
                "links" => [
                    "privacy_policy" => "سياسة الخصوصية",
                    'terms_of_service' => "شروط الخدمة",
                    'cookie_policy' => "سياسة ملفات تعريف الارتباط"
                ]
            ]
        ]
    ],
    "services_public" => [
        "name" => "أقسامنا",
        'title' => "أقسامنا",
    ],
    "service_details_public" => [
        "name" => "قسمنا",
        'title' => "تفاصيل القسم :name",
    ],
    'services' => [
        'name' => 'إدارة الأقسام',
        'titles' => [
            'main' => 'إدارة الأقسام',
        ],
    ],

    'service' => [
        'default' => [
            "name" => "إدارة القسم",
            "titles" => [
                "main" => "إدارة القسم"
            ]
        ],
        'name' => ':name',
        'titles' => [
            'main' => 'إدارة القسم :name',
        ],
    ],

    'bonuses' => [
        'name' => 'إدارة المكافآت',
        'titles' => [
            'main' => 'إدارة المكافآت',
        ],
    ],

    'global_transfers' => [
        'name' => 'إدارة التحويلات العامة',
        'titles' => [
            'main' => 'إدارة التحويلات العامة',
        ],
    ],

    'global_transfer_details' => [
        'name' => 'تفاصيل التحويلات العامة',
        'titles' => [
            'main' => 'إدارة تفاصيل التحويل :motive',
        ],
    ],
];
