<?php

return [
    "banking_information" => [
        "account" => [
            "length" => "للتحقق الناجح، يجب أن يتكون رقم حسابك من 20 رقمًا بالضبط.",
            "check" => "فشل التحقق من رقم الحساب. المفتاح المقدم كان: :providedKey.
                                 المفتاح الصحيح هو: :ribKey.",
            "exists_not_active" => "رقم الحساب :account غير نشط حاليًا. يرجى التأكد من تفعيل الحساب قبل المتابعة.",
            "not_exist" => "لا توجد معلومات بنكية نشطة لهذا الحساب. تحتاج إلى حساب بنكي صالح ونشط للمتابعة.",
        ]
    ],

    "land_line" => [
        "invalid" => "رقم :number المحدد يجب ألا يكون مساوياً لرقم هاتف أرضي موجود أو رقم فاكس"
    ],
    "daira" => [
        "invalid" => "يجب أن تكون الدائرة ':name' صالحة وتوجد في ولايتك. يرجى التحقق من الاسم أو الاتصال بمسؤولك."
    ]

    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////           App

];
