<?php

return [
    "default" => [
        "persons" => "-- اختر شخصًا --",
        "users" => "-- اختر مستخدمًا --",
        "banks" => "-- اختر بنكًا --",
        'fields' => "-- اختر مجالًا --",
        'field_specialties' => "-- اختر تخصصًا --",
        'field_grades' => "-- اختر درجة --",
        'dairates' => "-- اختر دائرة --",

        /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////           App

        'services' => "-- اختر قسمًا --",
        'head_service' => "-- اختر رئيس القسم --",

    ]
];
