<?php

return [
    "common" => [
        "excel-file-type-err" => "يجب أن يكون الملف بتنسيق Excel (XLSX, XLS, CSV)",
        "actions" => "الإجراءات",
        "perPage" => "لكل صفحة"
    ],

    'images' => [
        "info" => "قائمة ملفات الصور",
        "not_found" => "لم يتم العثور على ملفات صور",
        'display_name' => "اسم العرض",
        "use_case" => "حالة الاستخدام",
        'created_at' => "أضيف في",
        'preview' => "معاينة",
    ],
    'files' => [
        "info" => "قائمة ملفات PDF",
        "not_found" => "لم يتم العثور على ملفات PDF",
        'display_name' => "اسم العرض",
        "use_case" => "حالة الاستخدام",
        'created_at' => "أضيف في",
        'preview' => "معاينة",
        "download" => "تحميل الملف"
    ],

    'users' => [
        "info" => 'سجل المستخدمين',
        "not_found" => "لا يوجد مستخدمون متاحون",
        "name" => "اسم المستخدم",
        "email" => "البريد الإلكتروني",
        "avatar" => "الصورة الشخصية",
        "registration_date" => "تم إنشاء الحساب في",
        "excel" => [
            "upload" => [
                "success" => "تم استيراد المستخدمين بنجاح"
            ]
        ]
    ],
    'persons' => [
        "info" => "سجل الموظفين",
        "empty" => "لم يتم العثور على سجلات موظفين",
        "full_name" => "الاسم الكامل",
        "full_name_fr" => "الاسم الكامل (الفرنسية)",
        "full_name_ar" => "الاسم الكامل (العربية)",
        "employee_number" => "رقم الموظف",
        "social_number" => "رقم الضمان الاجتماعي",
        "email" => "البريد الإلكتروني الرسمي",
        "registration_date" => "تاريخ التسجيل",
        "phone" => "الهاتف",
        "card_number" => "رقم الهوية الوطنية",
        "birth_date" => "تاريخ الميلاد",
        "birth_place_fr" => "مكان الميلاد (الفرنسية)",
        "birth_place_ar" => "مكان الميلاد (العربية)",
        "birth_place_en" => "مكان الميلاد (الإنجليزية)",
        "excel" => [
            "upload" => [
                "success" => "تم استيراد سجلات الموظفين بنجاح"
            ]
        ]
    ],
    'our_qualities' => [
        'info' => 'قائمة جوداتنا',
        'not_found' => 'لم يتم العثور على جودات في الوقت الحالي',
        'created_at' => 'تاريخ الإضافة',
        'name' => 'الاسم',
        'status' => 'الحالة',
        'errors' => [
            'active_limit' => 'يمكن أن تكون 4 جودات فقط نشطة ليتم عرضها لزوار الموقع',
        ],
    ],
    'messages' => [
        'info' => 'رسائل الزوار',
        'not_found' => 'لم يتم العثور على رسائل زوار في الوقت الحالي',
        'name' => 'الاسم',
        'email' => 'البريد الإلكتروني',
        'created_at' => 'تاريخ الاستلام',
    ],

    'wilayates' => [
        "info" => "قائمة الولايات",
        "not_found" => "لم يتم العثور على ولايات في الوقت الحالي",
        "code" => "الرمز",
        "designation" => "التسمية",
        "designation_fr" => "التسمية (الفرنسية)",
        "designation_ar" => "التسمية (العربية)",
        "designation_en" => "التسمية (الإنجليزية)",
        "registration_date" => "تاريخ التسجيل",
        "excel" => [
            "upload" => [
                "success" => "تم تحميل قائمة الولايات بنجاح"
            ]
        ]
    ],
    'dairates' => [
        "info" => "دوائر الولاية (الرمز: :code)",
        "not_found" => "لا توجد دوائر متاحة في الوقت الحالي",
        "code" => "رمز الدائرة",
        "designation" => "اسم الدائرة",
        "designation_fr" => "الاسم الفرنسي",
        "designation_ar" => "الاسم العربي",
        "designation_en" => "الاسم الإنجليزي",
        "registration_date" => "تاريخ التسجيل",
        "excel" => [
            "upload" => [
                "success" => "تم استيراد بيانات الدوائر بنجاح"
            ]
        ]
    ],
    'communes' => [
        "info" => "بلديات الدائرة (الرمز: :code)",
        "not_found" => "لا توجد بلديات متاحة في الوقت الحالي",
        "code" => "رمز البلدية",
        "designation" => "اسم البلدية",
        "designation_fr" => "الاسم الفرنسي",
        "designation_ar" => "الاسم العربي",
        "designation_en" => "الاسم الإنجليزي",
        "registration_date" => "تاريخ التسجيل",
        "excel" => [
            "upload" => [
                "success" => "تم استيراد بيانات البلديات بنجاح"
            ]
        ]
    ],
    'fields' => [
        "info" => "قائمة المجالات",
        "not_found" => "لم يتم العثور على مجالات في الوقت الحالي",
        "acronym" => "الاختصار",
        "designation" => "التسمية",
        "designation_fr" => "التسمية (الفرنسية)",
        "designation_ar" => "التسمية (العربية)",
        "designation_en" => "التسمية (الإنجليزية)",
        "registration_date" => "تاريخ التسجيل",
        "excel" => [
            "upload" => [
                "success" => "تم تحميل قائمة المجالات بنجاح"
            ]
        ]
    ],
    'field_grades' => [
        "info" => "مستويات الدرجة للمجال: :acronym",
        "not_found" => "لا توجد مستويات درجة متاحة في الوقت الحالي",
        "acronym" => "رمز الدرجة",
        "designation" => "عنوان الدرجة",
        "designation_fr" => "العنوان الفرنسي",
        "designation_ar" => "العنوان العربي",
        "designation_en" => "العنوان الإنجليزي",
        "registration_date" => "تاريخ التسجيل",
        "excel" => [
            "upload" => [
                "success" => "تم استيراد مستويات الدرجة بنجاح"
            ]
        ]
    ],
    'field_specialties' => [
        "info" => "التخصصات المهنية: :acronym",
        "not_found" => "لا توجد تخصصات متاحة في الوقت الحالي",
        "acronym" => "رمز التخصص",
        "designation" => "عنوان التخصص",
        "designation_fr" => "العنوان الفرنسي",
        "designation_ar" => "العنوان العربي",
        "designation_en" => "العنوان الإنجليزي",
        "registration_date" => "تاريخ التسجيل",
        "excel" => [
            "upload" => [
                "success" => "تم استيراد التخصصات بنجاح"
            ]
        ]
    ],

    'occupations' => [
        "info" => "قائمة المهن",
        "info_custom" => "قائمة مهن :name",
        "not_found" => "لم يتم العثور على مهن في الوقت الحالي",
        "is_active" => "الحالة",
        "entitled" => "المسمى",
        "field" => "المجال",
        "experience" => "الخبرة",
        "specialty" => "التخصص",
        "grade" => "الدرجة",
        "created_at" => "أضيف في",
    ],
    'banking_information' => [
        "info" => "قائمة المعلومات البنكية",
        "info_custom" => "المعلومات البنكية لـ :name",
        "not_found" => "لم يتم العثور على معلومات بنكية في الوقت الحالي",
        "bank_acronym" => "البنك",
        "agency" => "الفرع",
        "agency_code" => "رمز الفرع",
        "account_number" => "رقم الحساب",
        "is_active" => "الحالة",
        "created_at" => "أضيف في",
    ],

    'banks' => [
        "info" => "دليل البنوك",
        "not_found" => "لا توجد بنوك متاحة في الوقت الحالي",
        'code' => "الرمز البنكي",
        'acronym' => "اختصار البنك",
        "designation" => "اسم البنك",
        "designation_fr" => "الاسم الفرنسي",
        "designation_ar" => "الاسم العربي",
        "designation_en" => "الاسم الإنجليزي",
        "created_at" => "تاريخ التسجيل",
    ],
    'menus' => [
        "info" => "قائمة القوائم",
        "not_found" => "لم يتم العثور على قوائم في الوقت الحالي",
        "title" => "العنوان",
        "state" => "الحالة",
        "type" => "النوع",
        "created_at" => "أضيف في",
    ],
    'external_links' => [
        "info" => "قائمة الروابط الخارجية",
        "not_found" => "لم يتم العثور على روابط خارجية في الوقت الحالي",
        "name" => "الاسم",
        "url" => "الرابط",
        "created_at" => "أضيف في",
    ],
    'articles' => [
        "info" => "قائمة المقالات",
        "not_found" => "لم يتم العثور على مقالات في الوقت الحالي",
        "created_at" => "أضيف في",
        'author' => "المؤلف",
        'title' => "العنوان",
        "articleable_type" => "نشر لـ",
        "articleable_id" => "نشر في",
        "location" => "الموقع",
        "state" => "الحالة",
    ],
    'sliders' => [
        "info" => "قائمة العروض التقديمية",
        "not_found" => "لم يتم العثور على عروض تقديمية",
        "created_at" => "أضيف في",
        'creator' => "المنشئ",
        'name' => "الاسم",
        "position" => "الموقع",
        "location" => "الموقع",
        "state" => "الحالة",
    ],
    "slides" => [
        "info" => "قائمة العروض التقديمية",
        "not_found" => "لم يتم العثور على عروض تقديمية في الوقت الحالي",
        "created_at" => "أضيف في",
        'title' => "العنوان",
        'order' => 'الترتيب',
        'image' => "الصورة",
        "location" => "الموقع",
        "state" => "الحالة",
    ],
    "trends" => [
        "info" => "قائمة الاتجاهات",
        "not_found" => "لم يتم العثور على اتجاهات في الوقت الحالي",
        "created_at" => "أضيف في",
        'title' => "العنوان",
        "state" => "الحالة",
    ],

    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////           App

    'services' => [
        "info" => "قائمة أقسام المؤسسة",
        "not_found" => "لا توجد أقسام مسجلة في الوقت الحالي",
        "created_at" => "تاريخ التسجيل",
        "name" => "اسم القسم",
        "name_fr" => "اسم القسم (الفرنسية)",
        "name_en" => "اسم القسم (الإنجليزية)",
        "name_ar" => "اسم القسم (العربية)",
        "tel" => "الهاتف الرئيسي",
        "fax" => "الفاكس",
        'email' => "البريد الإلكتروني",
        'beds_number' => "عدد الأسرة",
        'specialists_number' => "عدد الأخصائيين",
        'physicians_number' => "عدد الأطباء",
        'paramedics_number' => "عدد المساعدين الطبيين",
        "head_service" => "رئيس القسم",
        "specialty" => "التخصص الطبي",
        "excel" => [
            "upload" => [
                "success" => "تم استيراد الأقسام بنجاح"
            ]
        ]
    ],
    'global_transfers' => [
        "info" => "نظرة عامة على التحويلات العامة",
        "not_found" => "لا توجد تحويلات عامة متاحة",
        "initiator" => "المبتدئ",
        "motive" => "السبب",
        "total_amount" => "المبلغ الإجمالي",
        "reference" => "المرجع",
        'date' => "تاريخ التحويل",
        'number' => "رقم التحويل",
        'date_min' => "من تاريخ",
        'date_max' => "إلى تاريخ",
        "created_at" => "تاريخ الإنشاء",
    ],

    'bonuses' => [
        "info" => "قائمة المكافآت",
        "not_found" => "لا توجد مكافآت متاحة",
        "titled" => "العنوان",
        "amount" => "المبلغ",
        "created_at" => "تاريخ الإنشاء",
    ],
    'transfers' => [
        "info" => "قائمة التحويلات - :motive",
        "not_found" => "لا توجد تحويلات متاحة",
        "beneficiary" => "المستفيد",
        "bank" => "البنك",
        'account' => "رقم الحساب",
        'amount' => "المبلغ",
        "excel" => [
            "upload-success" => "تمت معالجة ملف Excel بنجاح"
        ],
        "errors" => [
            "bonuses" => [
                "not_selected" => "لم يتم اختيار مكافآت",
                "not_set" => "يرجى اختيار المكافآت من الجدول أعلاه",
                "empty" => "أضف تحويلات قبل تعيين المكافآت"
            ],
            "not_found" => [
                "active_establishment_banking_info" => "يرجى إضافة معلومات بنكية للمؤسسة أو تفعيل التفاصيل الموجودة"
            ]
        ]
    ],
];
