<?php

return [
    "common" => [
        "filters" => "فتح المرشحات",
        "resetFilters" => "إعادة تعيين المرشحات",
        "resetForm" => "إعادة تعيين النموذج",
        "add" => "إضافة جديد",
        "update" => "تحديث",
        "previous" => [
            "page" => "الصفحة السابقة"
        ],
        "manage" => [
            "sliders" => "إدارة العروض التقديمية",
            "articles" => "إدارة المقالات",
        ],
    ],

    'image' => [
        "delete" => "حذف الصورة",
        "update" => "تحديث الصورة",
    ],
    'file' => [
        "delete" => "حذف الملف",
        "update" => "تحديث الملف",
    ],

    "user" => [
        "delete" => "حذف هذا المستخدم",
        "update" => "تحديث هذا المستخدم",
        "manage" => [
            "roles" => "إدارة أدوار المستخدم",
            "occupations" => "إدارة مهن المستخدم",
            "banking_information" => "إدارة المعلومات البنكية للمستخدم",
            'users' => "إضافة موظفين"
        ],
        "excel" => [
            "empty" => "إنشاء ملف Excel فارغ للمستخدمين",
            "download" => "تصدير ملف Excel للمستخدمين",
            "upload" => "استيراد ملف Excel للمستخدمين",
        ]
    ],

    "person" => [
        "delete" => "حذف الموظف",
        "update" => "تعديل الموظف",
        "manage" => [
            "account" => "إدارة الحساب",
            "occupations" => "إدارة المهن",
            "banking_information" => "إدارة المعلومات البنكية",
            'persons' => "إضافة موظفين"
        ],
        "excel" => [
            "empty" => "تحميل القالب",
            "download" => "التصدير إلى Excel",
            "upload" => "الاستيراد من Excel",
        ]
    ],

    'our_quality' => [
        'update' => 'تحديث هذه الجودة',
        'delete' => 'حذف هذه الجودة',
    ],

    "message" => [
        "delete" => "حذف هذه الرسالة",
        "reply" => "الرد على هذه الرسالة"
    ],

    "wilaya" => [
        "delete" => "حذف الولاية",
        "update" => "تحديث الولاية",
        "manage" => [
            "view" => "عرض تفاصيل الولاية",
        ],
        "excel" => [
            "empty" => "تحميل القالب",
            "download" => "تصدير بيانات الولاية",
            "upload" => "استيراد بيانات الولاية"
        ]
    ],

    "daira" => [
        "delete" => "حذف الدائرة",
        "update" => "تحديث الدائرة",
        "manage" => [
            "communes" => "إدارة البلديات",
        ],
        "excel" => [
            "empty" => "تحميل القالب",
            "download" => "تصدير بيانات الدائرة",
            "upload" => "استيراد بيانات الدائرة"
        ]
    ],

    "commune" => [
        "delete" => "حذف البلدية",
        "update" => "تحديث البلدية",
        "excel" => [
            "empty" => "تحميل القالب",
            "download" => "تصدير بيانات البلدية",
            "upload" => "استيراد بيانات البلدية"
        ]
    ],

    "field" => [
        "delete" => "حذف المجال",
        "update" => "تحديث المجال",
        "manage" => [
            "specialties" => "إدارة تخصصات المجال",
            "grades" => "إدارة مستويات الدرجات",
            'fields' => "تعيين مجالات"
        ],
        "excel" => [
            "empty" => "تحميل القالب",
            "download" => "تصدير بيانات المجال",
            "upload" => "استيراد بيانات المجال"
        ]
    ],

    "field_grade" => [
        "delete" => "حذف مستوى الدرجة",
        "update" => "تحديث مستوى الدرجة",
        "manage" => [
            'fields' => "تعيين مجالات مهنية"
        ],
        "excel" => [
            "empty" => "تحميل القالب",
            "download" => "تصدير بيانات الدرجة",
            "upload" => "استيراد بيانات الدرجة"
        ]
    ],

    "field_specialty" => [
        "delete" => "حذف التخصص",
        "update" => "تحديث التخصص",
        "manage" => [
            'fields' => "تعيين تخصصات مهنية"
        ],
        "excel" => [
            "empty" => "تحميل القالب",
            "download" => "تصدير بيانات التخصص",
            "upload" => "استيراد بيانات التخصص"
        ]
    ],

    "occupation" => [
        "delete" => "حذف هذه المهنة",
        "update" => "تحديث هذه المهنة"
    ],
    "banking_information" => [
        "delete" => "حذف هذه المعلومات البنكية",
        "update" => "تحديث هذه المعلومات البنكية"
    ],

    "bank" => [
        "delete" => "حذف هذا البنك",
        "update" => "تحديث هذا البنك"
    ],

    "menu" => [
        "delete" => "حذف هذه القائمة",
        "update" => "تحديث هذه القائمة",
        "manage" => "إضافة روابط خارجية"
    ],

    "external_link" => [
        "delete" => "حذف هذا الرابط الخارجي",
        "update" => "تحديث هذا الرابط الخارجي"
    ],

    "slider" => [
        "delete" => "حذف هذا العرض التقديمي",
        "update" => "تحديث هذا العرض التقديمي",
        'manage' => "إضافة شرائح"
    ],

    "slide" => [
        "delete" => "حذف هذه الشريحة",
        "update" => "تحديث هذه الشريحة"
    ],

    "article" => [
        "delete" => "حذف هذا المقال",
        "update" => "تحديث هذا المقال"
    ],

    "trend" => [
        "delete" => "حذف هذا الاتجاه",
        "update" => "تحديث هذا الاتجاه"
    ],

    'service' => [
        "delete" => "حذف القسم",
        "update" => "تحديث القسم",
        "manage" => [
            "view" => "عرض تفاصيل القسم",
            "bulk_insert" => "استيراد جماعي للأقسام",
            "coordinators" => "إدارة المنسقين",
        ],
        "excel" => [
            "empty" => "تحميل القالب",
            "download" => "تصدير بيانات القسم",
            "upload" => "استيراد بيانات القسم"
        ]
    ],

    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////           App

    "bonus" => [
        "delete" => "حذف المكافأة",
        "update" => "تعديل المكافأة",
    ],

    "global_transfer" => [
        "delete" => "حذف التحويل العام",
        "update" => "تعديل التحويل العام",
        "manage" => "إدارة تفاصيل التحويل"
    ],

    "transfer" => [
        "delete" => "حذف التحويل",
        "update" => "تعديل التحويل",
        "generate" => "إنشاء ملف EDI",
        "excel" => [
            "upload" => "استيراد التحويلات",
            "export" => "تصدير التحويلات",
            "empty" => "تحميل القالب"
        ],
        "bonuses" => "إدارة المكافآت"
    ],
];
